package com.example.demo.help;

import java.util.*;

public class Constant {
    public static final List<String> PrimerDryStatus = Arrays.asList("设备准备就绪","急停","喷漆房总运行","烘干房总运行","烘干房照明","喷漆房照明","喷漆房排风运行","喷漆房送风机1运行"
    ,"喷漆房送风机2","烘干房循环风机运行","烘干房燃烧器大火运行","烘干房燃烧器小火运行","烘干房热风幕机1运行","烘干房热风幕机2运行","烘干房废气强排运行");
    public static final List<String> TopcoatDryStatus = Arrays.asList("设备准备就绪","急停","喷漆房总运行","烘干房总运行","烘干房照明","喷漆房照明","喷漆房排风运行","喷漆房送风机1运行"
            ,"喷漆房送风机2","烘干房循环风机运行","烘干房燃烧器大火运行","烘干房燃烧器小火运行","烘干房热风幕机1运行","烘干房热风幕机2运行","烘干房废气强排运行");
    public static final List<String> PrimerSprayStatus = Arrays.asList("主控柜手动模式","主控柜半自动模式","主控柜自动模式","运行","主控柜急停","1#喷枪启动"
            ,"2#喷枪启动","3#喷枪启动","4#喷枪启动","5#喷枪启动","6#喷枪启动","7#喷枪启动","8#喷枪启动","9#喷枪启动","10#喷枪启动","11#喷枪启动","12#喷枪启动");
    public static final List<String> TopcoatSprayStatus = Arrays.asList("主控柜手动模式","主控柜半自动模式","主控柜自动模式","运行","主控柜急停","1#喷枪启动"
            ,"2#喷枪启动","3#喷枪启动","4#喷枪启动","5#喷枪启动","6#喷枪启动","7#喷枪启动","8#喷枪启动","9#喷枪启动","10#喷枪启动","11#喷枪启动","12#喷枪启动");
}
